[
  {
    "id": 1,
    "title": "Week 01: The Vibe Code Kickoff",
    "description": "Build a working web app using tools like Replit Agent, Lovable, or Cursor to track your progress through the 10-weekend resolution; the goal is to deploy a live tracker with features like checkboxes, notes, and a progress bar.",
    "isCompleted": true,
    "notes": "Vibe Code App to track progress.  Opted for local VM development environment and used AntiGravity to plan, build and test applicaiton.\n\nImplemented persistent (to file) storage."
  },
  {
    "id": 2,
    "title": "Week 02: The Model Mapping Project",
    "description": "Create a \"Model Topography Sheet\" and a one-page \"Rules of Thumb\" document by testing different tasks (writing, strategy, data) across models like Claude, ChatGPT, and Gemini to determine which tool is best suited for your specific workflows.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 3,
    "title": "Week 03: The Deep Research Sprint",
    "description": "Use AI deep research tools to produce a 2-page research brief regarding a real-life decision you need to make, resulting in a clear recommendation that outlines options, findings, and risks.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 4,
    "title": "Week 04: The Analysis Project",
    "description": "Take a messy dataset (e.g., from a spreadsheet or CSV), clean it, and produce a one-page Insights Memo that identifies top drivers and specific actions, moving beyond simple charts to actual decision-making.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 5,
    "title": "Week 05: The Visual Reasoning Project",
    "description": "Generate an infographic, diagram, or visual explainer that communicates a complex concept, process, or timeline instantly, prioritizing visual logic over artistic design to explain ideas faster than words.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 6,
    "title": "Week 06: The Information Pipeline",
    "description": "Establish a reusable workflow using NotebookLM and Gamma that transforms a single source input (like a transcript or report) into a summary, FAQ, and presentation deck in under 7 minutes.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 7,
    "title": "Week 07: The First Automation",
    "description": "Build a \"Content Distribution Machine\" using tools like Lindy, n8n, or Make to handle a production or distribution task (such as a weekly reading digest) automatically, including triggers and routing.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 8,
    "title": "Week 08: The Second Automation",
    "description": "Construct a \"Productivity Workflow,\" such as a meeting prep bot or inbox manager, that automatically manages inputs and creates follow-ups or dashboards to prevent tasks from falling through the cracks.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 9,
    "title": "Week 09: The Context Engineering Project",
    "description": "Build a \"Personal AI Operating System\" that includes a reusable Professional Context Document (containing role, style, and project details) to paste into chats, eliminating the need to repeat context for every new conversation.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 10,
    "title": "Week 10: The AI-Powered Build",
    "description": "Create and deploy a working application—such as a knowledge chatbot, voice agent, or data extraction tool—that uses AI as its core feature rather than just helping you build it.",
    "isCompleted": false,
    "notes": ""
  },
  {
    "id": 11,
    "title": "Bonus Weekend: The Agent Exploration",
    "description": "Run the \"Agent Evaluation Gauntlet\" to produce an Agent Scorecard and identify specific use cases; this involves testing agents against research, operations, and production tasks to determine which are safe to delegate unsupervised versus those requiring human oversight.",
    "isCompleted": false,
    "notes": ""
  }
]